Repository: awesome-academy/python_cevc_huy_duy
Catalog: locale/*/LC_MESSAGES/django.po
Languages: vi

source: An error occurred
vi: Đã xảy ra lỗi

source: The requested resource was not found.
vi: Tài nguyên được yêu cầu không được tìm thấy.

source: You are not authorized to access this resource.
vi: Bạn không được phép truy cập tài nguyên này.

source: You do not have permission to perform this action.
vi: Bạn không có quyền thực hiện hành động này.

source: The request was invalid or cannot be served.
vi: Yêu cầu không hợp lệ hoặc không thể được xử lý.

source: An unexpected error occurred on the server.
vi: Đã xảy ra lỗi không mong muốn trên máy chủ.

source: The request method is not allowed for this endpoint.
vi: Phương thức yêu cầu không được phép cho endpoint này.

source: The request was well-formed but was unable to be followed due to semantic errors.
vi: Yêu cầu được định dạng tốt nhưng không thể thực hiện do lỗi ngữ nghĩa.

source: The query could not be executed successfully.
vi: Truy vấn không thể được thực thi thành công.

source: The requested page was not found.
vi: Trang được yêu cầu không được tìm thấy.

source: Too many requests. Please try again later.
vi: Quá nhiều yêu cầu. Vui lòng thử lại sau.

source: The service is temporarily unavailable.
vi: Dịch vụ tạm thời không khả dụng.

source: Malformed request data.
vi: Dữ liệu yêu cầu không đúng định dạng.

source: Authentication credentials were not provided or are invalid.
vi: Thông tin xác thực không được cung cấp hoặc không hợp lệ.

source: Authentication credentials were not provided.
vi: Thông tin xác thực không được cung cấp.

source: Could not satisfy the request Accept header.
vi: Không thể đáp ứng header Accept của yêu cầu.

source: Unsupported media type in request.
vi: Loại media không được hỗ trợ trong yêu cầu.

source: Request was throttled. Please try again later.
vi: Yêu cầu bị giới hạn tốc độ. Vui lòng thử lại sau.

source: Request was throttled. Please wait {wait} seconds.
vi: Yêu cầu bị giới hạn tốc độ. Vui lòng chờ {wait} giây.

source: Invalid input provided.
vi: Dữ liệu đầu vào không hợp lệ.

source: This field is required.
vi: Trường này là bắt buộc.

source: This field must be between {min_val} and {max_val} degrees.
vi: Trường này phải nằm trong khoảng từ {min_val} đến {max_val} độ.

source: This field may not be blank.
vi: Trường này không được để trống.

source: Enter a valid email address.
vi: Nhập một địa chỉ email hợp lệ.

source: This field must be at least {min_length} characters long.
vi: Trường này phải có ít nhất {min_length} ký tự.

source: Ensure this field has at most {max_length} characters.
vi: Đảm bảo trường này có tối đa {max_length} ký tự.

source: This field must be at least 8 characters long.
vi: Trường này phải có ít nhất 8 ký tự.

source: A user with that username already exists.
vi: Người dùng có tên đăng nhập này đã tồn tại.

source: A user with that email already exists.
vi: Người dùng có email này đã tồn tại.

source: Verification email has been resent.
vi: Email xác thực đã được gửi lại.

source: Password confirmation does not match.
vi: Xác nhận mật khẩu không khớp.

source: Registration successful. Please check your email to verify your account.
vi: Đăng ký thành công. Vui lòng kiểm tra email để xác thực tài khoản.

source: Registration failed. Please try again.
vi: Đăng ký thất bại. Vui lòng thử lại.

source: Email has been verified successfully.
vi: Email đã được xác thực thành công.

source: Verification email has been sent.
vi: Email xác thực đã được gửi.

source: Account has already been verified.
vi: Tài khoản đã được xác thực.

source: This email is already in use.
vi: Email này đã được sử dụng.

source: Email not found.
vi: Không tìm thấy email.

source: This username is already in use.
vi: Tên đăng nhập này đã được sử dụng.

source: Invalid token.
vi: Token không hợp lệ.

source: Token has expired.
vi: Token đã hết hạn.

source: Authentication token not provided.
vi: Chưa cung cấp token xác thực.

source: Logout successful.
vi: Đăng xuất thành công.

source: Invalid email or password.
vi: Email hoặc mật khẩu không đúng.

source: Account is not verified. Please check your email.
vi: Tài khoản chưa được xác thực. Vui lòng kiểm tra email.

source: Working space with this name and city already exists.
vi: Không gian làm việc với tên và thành phố này đã tồn tại.

source: Both latitude and longitude are required
vi: Cần có cả vĩ độ và kinh độ

source: Invalid latitude or longitude format
vi: Định dạng vĩ độ hoặc kinh độ không hợp lệ

source: Invalid coordinate values
vi: Giá trị tọa độ không hợp lệ

source: Working space created successfully
vi: Tạo không gian làm việc thành công

source: Working space updated successfully
vi: Cập nhật không gian làm việc thành công

source: Working space deleted successfully
vi: Xóa không gian làm việc thành công

source: Working space not found
vi: Không tìm thấy không gian làm việc

source: Cannot delete working space due to existing dependencies
vi: Không thể xóa không gian làm việc do có các phụ thuộc tồn tại

source: If location filtering is used, latitude, longitude, and radius must all be provided.
vi: Nếu sử dụng bộ lọc vị trí, vĩ độ, kinh độ và bán kính phải được cung cấp đầy đủ.

source: For location filtering, latitude, longitude, and radius are all required.
vi: Để lọc theo vị trí, vĩ độ, kinh độ và bán kính đều là bắt buộc.

source: Space with this name already exists in this working space.
vi: Không gian với tên này đã tồn tại trong không gian làm việc này.

source: Close time must be after open time.
vi: Thời gian đóng cửa phải sau thời gian mở cửa.

source: Space created successfully.
vi: Tạo không gian thành công.

source: Space updated successfully.
vi: Cập nhật không gian thành công.

source: Space deleted successfully.
vi: Xóa không gian thành công.

source: Space not found.
vi: Không tìm thấy không gian.

source: Cannot delete space due to existing dependencies.
vi: Không thể xóa không gian do có các phụ thuộc tồn tại.

source: Working space is required.
vi: Không gian làm việc là bắt buộc.

source: Space not found in this working space
vi: Không tìm thấy không gian trong không gian làm việc này

source: Space does not belong to this working space.
vi: Không gian không thuộc về không gian làm việc này.

source: Cannot delete space: associated working space no longer exists.
vi: Không thể xóa không gian: không gian làm việc liên kết không còn tồn tại.
